app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(params[:comment])
---
INSERT INTO "comments" ("content", "created_at", "submission_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "salarsucks"], ["created_at", Thu, 31 Oct 2013 19:19:04 UTC +00:00], ["submission_id", 1], ["updated_at", Thu, 31 Oct 2013 19:19:04 UTC +00:00]]