app/controllers/submissions_controller.rb

SELECT "submissions".* FROM "submissions"
---
  def index
    @submission = Submission.all

INSERT INTO "submissions" ("created_at", "title", "updated_at", "url") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Wed, 30 Oct 2013 23:09:32 UTC +00:00], ["title", "annie is so smart"], ["updated_at", Wed, 30 Oct 2013 23:09:32 UTC +00:00], ["url", "http://www.annierocks.com"]]
---
  def create
    @new_submission = Submission.new
    @new_submission.title = params[:submissions][:title]
    @new_submission.url = params[:submissions][:url]
    @new_submission.save