app/controllers/users_controller.rb

	def create
		@user = User.new
		@user.username = params[:user][:username]
		@user.password = params[:user][:password]
		if @user.save
---
INSERT INTO "users" ("created_at", "password", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Thu, 31 Oct 2013 22:20:44 UTC +00:00], ["password", "asdfgasdhfasfh"], ["updated_at", Thu, 31 Oct 2013 22:20:44 UTC +00:00], ["username", "asfhgafh"]]